package main

import (
	"fmt"

	"time"
)

func main() {

	ch := make(chan int, 3)

	ch <- 2

	ch <- 2

	ch <- 2

	close(ch)

	go sum(ch)

	time.Sleep(time.Second * 1)

}

func sum(ch chan int) {

	sum := 0

	for val := range ch {

		sum += val

	}

	fmt.Printf("Sum: %d\n", sum)

}

// در کد فوق ما یک کانال بافر شده با ظرفیت ۳ ایجاد کردیم سپس ۳ تا مقدار به کانال ارسال
//کردیم و داخل تابع sum مقادیر را با استفاده از حلقه for-range دریافت و پس از آن چاپ کردیم.
//
//حالا یک سوال پیش می آید آیا ما اگر کانال را در تابع main نبندیم چه اتفاقی می افتد؟ اگر شما کانال را نبندید بطور حتمی با
//خطا deadlock مواجه خواهید شد. حلقه ای که داخل تابع sum قرار دادید برای دریافت داده هیچوقت متوقف نخواهد شد.
//
//پس سعی کنید همیشه و همه جا در جای درست بستن کانال را انجام دهید تا دچار مشکلات مختلف نشوید.
